/*
 * bluetooth.h
 *
 *  Created on: 2024年7月29日
 *      Author: Rev_RoastDuck
 */

#ifndef DEVICES_BLUETOOTH_H_
#define DEVICES_BLUETOOTH_H_

/******************************************************************************/
/*---------------------------------头文件引入---------------------------------*/
/******************************************************************************/
#include "Driver_USART.h"
#include "protocol.h"
#include "debug_uart.h"
#include "typedef.h"
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>

/******************************************************************************/
/*------------------------------------结构体----------------------------------*/
/******************************************************************************/
typedef struct _RRD_DEVICE_BLUETOOTH{
	int8_t 	(*init)									(void);
	void 		(*send)									(const char *fmt,...);
	void 		(*send_buff) (uint8_t *vector,uint16_t len);

}RRD_DEVICE_BLUETOOTH;


/******************************************************************************/
/*----------------------------------全局函数----------------------------------*/
/******************************************************************************/
extern RRD_DEVICE_BLUETOOTH BLUETOOTH_DEVICE;

#endif
